tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nikitabobko/tap"
tap "romkatv/powerlevel10k"
tap "sst/tap"
tap "supabase/tap"
brew "bash"
brew "docker"
brew "fd"
brew "fnm"
brew "fzf"
brew "go"
brew "hyperfine"
brew "jq"
brew "lua-language-server"
brew "luarocks"
brew "neovim", args: ["HEAD"]
brew "pnpm"
brew "powerlevel10k"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tmux"
brew "uv"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "sst/tap/opencode"
brew "supabase/tap/supabase"
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "alfred"
cask "font-geist-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "karabiner-elements"
cask "kitty"
cask "postman"
cask "rectangle"
cask "wezterm"
cask "zen"
